import LatestNewsItem from "./LatestNewsItem";

type TLatestNews = {
  title: string;
  hour: number;
  company: string;
  content: string;
  image: string;
};

const data: TLatestNews[] = [
  {
    title: `"산유국 되나" 尹 한 마디에 한국석유 또 '上'…석유주 훨훨`,
    hour: 1,
    company: "문화일보",
    content: `윤석열 대통령이 "포항 앞바다에 막대한 양의 석유·천연가스 매장
              가능성이 있다"고 발표하면서 석유주가 이틀째 급등했다.3일
              한국석유(004090)는 전일대비 5350원(29.81%) 오른 2만3300원에 거래를
              마쳤다. 한국석유는 전날에도 상한가로 장을 마친 바 있다.이 외에도
              한국ANKOR유전도 상한가를 찍었고, 흥구석유(024060)는 18.40% 올랐다.
              윤석열 대통령은 전날 용산 대통령실에서 열린 국정 브리핑에서 "포항
              영일만 앞바다에 막대한 양의 석유와 가스가 매장돼 있을 가능성이
              높다는 물리탐사 결과가 나왔다"고 밝혔다.매장량은 최대 140억 배럴
              가능성이 예상되며 천연가스는 29년, 석유는 4년 이상 사용할 양이라고
              설명했다.`,
    image: "/images/news_img06.png",
  },
  {
    title: `"산유국 되나" 尹 한 마디에 한국석유 또 '上'…석유주 훨훨`,
    hour: 1,
    company: "문화일보",
    content: `윤석열 대통령이 "포항 앞바다에 막대한 양의 석유·천연가스 매장
              가능성이 있다"고 발표하면서 석유주가 이틀째 급등했다.3일
              한국석유(004090)는 전일대비 5350원(29.81%) 오른 2만3300원에 거래를
              마쳤다. 한국석유는 전날에도 상한가로 장을 마친 바 있다.이 외에도
              한국ANKOR유전도 상한가를 찍었고, 흥구석유(024060)는 18.40% 올랐다.
              윤석열 대통령은 전날 용산 대통령실에서 열린 국정 브리핑에서 "포항
              영일만 앞바다에 막대한 양의 석유와 가스가 매장돼 있을 가능성이
              높다는 물리탐사 결과가 나왔다"고 밝혔다.매장량은 최대 140억 배럴
              가능성이 예상되며 천연가스는 29년, 석유는 4년 이상 사용할 양이라고
              설명했다.`,
    image: "/images/news_img07.png",
  },
  {
    title: `"산유국 되나" 尹 한 마디에 한국석유 또 '上'…석유주 훨훨`,
    hour: 1,
    company: "문화일보",
    content: `윤석열 대통령이 "포항 앞바다에 막대한 양의 석유·천연가스 매장
              가능성이 있다"고 발표하면서 석유주가 이틀째 급등했다.3일
              한국석유(004090)는 전일대비 5350원(29.81%) 오른 2만3300원에 거래를
              마쳤다. 한국석유는 전날에도 상한가로 장을 마친 바 있다.이 외에도
              한국ANKOR유전도 상한가를 찍었고, 흥구석유(024060)는 18.40% 올랐다.
              윤석열 대통령은 전날 용산 대통령실에서 열린 국정 브리핑에서 "포항
              영일만 앞바다에 막대한 양의 석유와 가스가 매장돼 있을 가능성이
              높다는 물리탐사 결과가 나왔다"고 밝혔다.매장량은 최대 140억 배럴
              가능성이 예상되며 천연가스는 29년, 석유는 4년 이상 사용할 양이라고
              설명했다.`,
    image: "/images/news_img08.png",
  },
  {
    title: `"산유국 되나" 尹 한 마디에 한국석유 또 '上'…석유주 훨훨`,
    hour: 1,
    company: "문화일보",
    content: `윤석열 대통령이 "포항 앞바다에 막대한 양의 석유·천연가스 매장
              가능성이 있다"고 발표하면서 석유주가 이틀째 급등했다.3일
              한국석유(004090)는 전일대비 5350원(29.81%) 오른 2만3300원에 거래를
              마쳤다. 한국석유는 전날에도 상한가로 장을 마친 바 있다.이 외에도
              한국ANKOR유전도 상한가를 찍었고, 흥구석유(024060)는 18.40% 올랐다.
              윤석열 대통령은 전날 용산 대통령실에서 열린 국정 브리핑에서 "포항
              영일만 앞바다에 막대한 양의 석유와 가스가 매장돼 있을 가능성이
              높다는 물리탐사 결과가 나왔다"고 밝혔다.매장량은 최대 140억 배럴
              가능성이 예상되며 천연가스는 29년, 석유는 4년 이상 사용할 양이라고
              설명했다.`,
    image: "/images/news_img09.png",
  },
];

export default function LatestNews() {
  return (
    <>
      <section className="w-[1200px] pt-12 pb-20 mx-auto">
        <h2 className="mb-6 text-navy-900 text-3xl font-bold">최신 뉴스</h2>
        <ul className="p-12 bg-white text-grayscale-900 rounded-lg">
          {data.map((item, index) => (
            <LatestNewsItem
              key={index}
              title={item.title}
              hour={item.hour}
              company={item.company}
              content={item.content}
              image={item.image}
            />
          ))}
        </ul>
      </section>
    </>
  );
}
